<template>
  <div class="com-chart" ref="chartRef"></div>
</template>
<script>
export default {
  data() {
    return {
      chartInstance: null, // echart图表实例
      chartData: null, // 图表展示数据
      ChartOptionName: '故障分布图表配置',
      chartOption: '', // 图表配置信息option
      optionList: [], //故障分布图保存的历史配置信息
    }
  },
  props: ['currentWeek', 'newDataAndScript'],
  watch: {
    // 监听父组件传来的新周数
    currentWeek: {
      handler: function(newVal, oldVal) {
        // this.getData()
        // this.initChart()
        // this.sendOption()
      },
      immediate: true,
    },
    newDataAndScript: {
      deep: true,
      handler: function(val) {
        // if (val.data.length === 0) {
        //   this.changeChart(val.newEditorContent, this.chartData)
        // } else {
        //   this.changeChart(val.newEditorContent, val.data)
        // }
        this.changeChart(val.newEditorContent, val.data)
      },
    },
  },
  mounted() {
    this.initChart()
    //向父组件发送图表配置名称
    this.$emit('sendChartOptionName', this.ChartOptionName)
    window.addEventListener('resize', this.screenAdapter)
    // 在页面加载完成时候，主动进行屏幕适配
    this.screenAdapter()
  },

  methods: {
    //   初始化图表
    initChart() {
      // 初始化echart实例
      let myChart = this.$echarts.init(this.$refs.chartRef)
      let option
      var type = ['SAS盘', 'SSD盘', 'SATA盘']

      var data = [
        // { 故障日期: '2015-01-01', 存储: 'IBM-V7000(3-3-F05)', 故障类型: 'CPU' },
        // {
        //   故障日期: '2015-01-16',
        //   存储: 'IBM-V7000(1-1-H11)',
        //   故障类型: 'SAS盘',
        // },
        // {
        //   故障日期: '2015-01-03',
        //   存储: 'EMC-CX240(1-1-F11)',
        //   故障类型: 'SAS盘',
        // },
        // {
        //   故障日期: '2015-02-16',
        //   存储: 'EMC-CX240(1-1-F11)',
        //   故障类型: '电源',
        // },
        // { 故障日期: '2015-02-16', 存储: 'IBM-V7000(3-3-F05)', 故障类型: 'CPU' },
        // {
        //   故障日期: '2015-02-26',
        //   存储: 'IBM-V7000(3-3-F05)',
        //   故障类型: '主板',
        // },
        // { 故障日期: '2015-03-12', 存储: 'IBM-V7000(3-3-F05)', 故障类型: 'CPU' },
        // { 故障日期: '2015-03-17', 存储: 'IBM-V7000(3-3-F05)', 故障类型: 'CPU' },
        // {
        //   故障日期: '2015-03-19',
        //   存储: 'IBM-DS8700(1-1-C08)',
        //   故障类型: '其他',
        // },
        // {
        //   故障日期: '2015-04-18',
        //   存储: 'IBM-DS8700(1-1-C08)',
        //   故障类型: 'SAS盘',
        // },
        // {
        //   故障日期: '2015-04-20',
        //   存储: 'EMC-VNX5300(3-3-F05)',
        //   故障类型: '软件',
        // },
        // {
        //   故障日期: '2015-05-14',
        //   存储: 'EMC-VNX5700(1-1-C04)',
        //   故障类型: 'SAS盘',
        // },
        // {
        //   故障日期: '2015-05-21',
        //   存储: 'EMC-CX240(1-1-F11)',
        //   故障类型: 'SAS盘',
        // },
        // {
        //   故障日期: '2015-05-31',
        //   存储: 'EMC-VNX5700(1-1-C04)',
        //   故障类型: '软件',
        // },
        // {
        //   故障日期: '2015-06-26',
        //   存储: 'EMC-VNX5300(1-1-F13)',
        //   故障类型: 'SAS盘',
        // },
        // {
        //   故障日期: '2015-07-12',
        //   存储: 'EMC-VNX5700(1-1-C04)',
        //   故障类型: '软件',
        // },
        // { 故障日期: '2015-08-22', 存储: 'IBM-SVC(1-1-H12)', 故障类型: 'SAS盘' },
        // {
        //   故障日期: '2015-08-27',
        //   存储: 'EMC-VNX5700(1-1-C04)',
        //   故障类型: '软件',
        // },
        // {
        //   故障日期: '2015-09-20',
        //   存储: 'IBM-DS8700(1-1-C08)',
        //   故障类型: 'SAS盘',
        // },
        // {
        //   故障日期: '2015-09-21',
        //   存储: 'IBM-DS8700(1-1-C08)',
        //   故障类型: 'SAS盘',
        // },
        // {
        //   故障日期: '2015-09-21',
        //   存储: 'IBM-DS8700(1-1-C08)',
        //   故障类型: 'SAS盘',
        // },
        // {
        //   故障日期: '2015-10-05',
        //   存储: 'IBM-DS8700(1-1-C08)',
        //   故障类型: 'SAS盘',
        // },
        // {
        //   故障日期: '2015-10-16',
        //   存储: 'EMC-VNX5700(1-1-C04)',
        //   故障类型: '软件',
        // },
        // {
        //   故障日期: '2015-10-16',
        //   存储: 'EMC-VNX5300(3-3-F05)',
        //   故障类型: '软件',
        // },
        // {
        //   故障日期: '2015-10-20',
        //   存储: 'IBM-V7000(1-1-H11)',
        //   故障类型: 'SAS盘',
        // },
        // {
        //   故障日期: '2015-10-26',
        //   存储: 'IBM-V7000(1-1-H11)',
        //   故障类型: 'SAS盘',
        // },
        // {
        //   故障日期: '2015-11-07',
        //   存储: 'IBM-V7000(1-1-H11)',
        //   故障类型: 'SAS盘',
        // },
        // {
        //   故障日期: '2015-11-16',
        //   存储: 'EMC-VNX5300(3-3-F05)',
        //   故障类型: 'SAS盘',
        // },
        // {
        //   故障日期: '2015-12-01',
        //   存储: 'EMC-VNX5700(1-1-C04)',
        //   故障类型: '软件',
        // },
        // {
        //   故障日期: '2015-12-04',
        //   存储: 'IBM-DS8700(1-1-C08)',
        //   故障类型: 'IO板',
        // },
        // {
        //   故障日期: '2015-12-21',
        //   存储: 'EMC-VNX5300(3-3-F05)',
        //   故障类型: '软件',
        // },
        // {
        //   故障日期: '2015-12-25',
        //   存储: 'IBM-DS8700(1-1-C08)',
        //   故障类型: 'SAS盘',
        // },
        // {
        //   故障日期: '2016-01-14',
        //   存储: 'EMC-VNX5700(1-1-C04)',
        //   故障类型: '软件',
        // },
        // {
        //   故障日期: '2016-02-05',
        //   存储: 'EMC-VNX5300(3-3-F05)',
        //   故障类型: '软件',
        // },
        // {
        //   故障日期: '2016-02-07',
        //   存储: 'EMC-VNX5700(1-1-C04)',
        //   故障类型: 'SAS盘',
        // },
        // {
        //   故障日期: '2016-02-16',
        //   存储: 'EMC-VNX5700(1-1-C04)',
        //   故障类型: 'SAS盘',
        // },
        // {
        //   故障日期: '2016-02-17',
        //   存储: 'EMC-VNX5700(1-1-C04)',
        //   故障类型: 'SAS盘',
        // },
        // {
        //   故障日期: '2016-03-02',
        //   存储: 'EMC-VNX5300(3-3-F05)',
        //   故障类型: '软件',
        // },
        // {
        //   故障日期: '2016-03-17',
        //   存储: 'IBM-DS8700(1-1-C08)',
        //   故障类型: 'SAS盘',
        // },
        // {
        //   故障日期: '2016-03-19',
        //   存储: 'EMC-VNX5700(1-1-C04)',
        //   故障类型: '软件',
        // },
        // {
        //   故障日期: '2016-04-01',
        //   存储: 'IBM-DS5100(1-1-F12)',
        //   故障类型: 'SAS盘',
        // },
        // {
        //   故障日期: '2016-04-29',
        //   存储: 'IBM-DS8700(1-1-C08)',
        //   故障类型: 'SAS盘',
        // },
        // {
        //   故障日期: '2016-05-26',
        //   存储: 'EMC-VNX5300(3-3-F05)',
        //   故障类型: '软件',
        // },
        // {
        //   故障日期: '2016-05-26',
        //   存储: 'EMC-VNX5700(1-1-C04)',
        //   故障类型: '软件',
        // },
        // {
        //   故障日期: '2016-06-25',
        //   存储: 'IBM-DS8700(1-1-C08)',
        //   故障类型: '其他',
        // },
        // {
        //   故障日期: '2016-07-02',
        //   存储: 'EMC-VNX5700(1-1-C03)',
        //   故障类型: 'SAS盘',
        // },
        // {
        //   故障日期: '2016-07-06',
        //   存储: 'EMC-VNX5300(3-3-F05)',
        //   故障类型: '软件',
        // },
        // {
        //   故障日期: '2016-07-31',
        //   存储: 'EMC-VNX5700(1-1-C04)',
        //   故障类型: '软件',
        // },
        // {
        //   故障日期: '2016-08-04',
        //   存储: 'IBM-DS8700(1-1-C08)',
        //   故障类型: 'SAS盘',
        // },
        // {
        //   故障日期: '2016-08-04',
        //   存储: 'IBM-V7000(1-1-H11)',
        //   故障类型: 'SAS盘',
        // },
        // {
        //   故障日期: '2016-08-07',
        //   存储: 'IBM-DS8700(1-1-C08)',
        //   故障类型: 'SAS盘',
        // },
        // {
        //   故障日期: '2016-08-24',
        //   存储: 'EMC-VNX5700(1-1-C04)',
        //   故障类型: 'SAS盘',
        // },
        // {
        //   故障日期: '2016-08-29',
        //   存储: 'IBM-DS8700(1-1-C08)',
        //   故障类型: 'SAS盘',
        // },
        // {
        //   故障日期: '2016-08-30',
        //   存储: 'IBM-DS8700(1-1-C08)',
        //   故障类型: 'SAS盘',
        // },
        // {
        //   故障日期: '2016-09-03',
        //   存储: 'EMC-VNX5300(3-3-F05)',
        //   故障类型: '软件',
        // },
        // {
        //   故障日期: '2016-09-08',
        //   存储: '3PAR-S7400(1-1-H01)',
        //   故障类型: '电源',
        // },
        // {
        //   故障日期: '2016-09-17',
        //   存储: 'IBM-DS8700(1-1-C08)',
        //   故障类型: 'SAS盘',
        // },
        // {
        //   故障日期: '2016-10-02',
        //   存储: 'EMC-VNX5700(1-1-C04)',
        //   故障类型: '软件',
        // },
        // {
        //   故障日期: '2016-10-07',
        //   存储: 'EMC-VNX5300(3-3-F05)',
        //   故障类型: 'SAS盘',
        // },
        // {
        //   故障日期: '2016-10-10',
        //   存储: 'EMC-VNX5700(1-1-C04)',
        //   故障类型: '软件',
        // },
        // {
        //   故障日期: '2016-10-13',
        //   存储: 'EMC-VNX5300(3-3-F05)',
        //   故障类型: 'SAS盘',
        // },
        // {
        //   故障日期: '2016-10-14',
        //   存储: 'IBM-DS8700(1-1-C08)',
        //   故障类型: 'IO板',
        // },
        // {
        //   故障日期: '2016-10-28',
        //   存储: 'IBM-DS8700(1-1-C08)',
        //   故障类型: '软件',
        // },
        // {
        //   故障日期: '2016-11-02',
        //   存储: 'EMC-VNX5300(3-3-F05)',
        //   故障类型: 'SAS盘',
        // },
        // {
        //   故障日期: '2016-11-18',
        //   存储: 'EMC-VNX5700(1-1-C03)',
        //   故障类型: 'SAS盘',
        // },
        // {
        //   故障日期: '2016-12-16',
        //   存储: 'IBM-DS8700(1-1-C08)',
        //   故障类型: 'SAS盘',
        // },
        // {
        //   故障日期: '2016-12-17',
        //   存储: 'IBM-DS8700(1-1-C08)',
        //   故障类型: 'SAS盘',
        // },
        // {
        //   故障日期: '2016-12-20',
        //   存储: 'IBM-DS8700(1-1-C08)',
        //   故障类型: 'SAS盘',
        // },
        // {
        //   故障日期: '2016-12-23',
        //   存储: 'EMC-VNX5700(1-1-C04)',
        //   故障类型: '软件',
        // },
        // {
        //   故障日期: '2017-01-08',
        //   存储: 'EMC-VNX5700(1-1-C03)',
        //   故障类型: 'SAS盘',
        // },
        // {
        //   故障日期: '2017-01-19',
        //   存储: 'IBM-DS8700(1-1-C08)',
        //   故障类型: 'IO板',
        // },
        // {
        //   故障日期: '2017-01-22',
        //   存储: 'EMC-VNX5700(1-1-C04)',
        //   故障类型: 'SAS盘',
        // },
        // {
        //   故障日期: '2017-01-24',
        //   存储: 'EMC-VNX5700(1-1-C04)',
        //   故障类型: '软件',
        // },
        // {
        //   故障日期: '2017-02-11',
        //   存储: 'IBM-DS8700(1-1-C08)',
        //   故障类型: 'SAS盘',
        // },
        // {
        //   故障日期: '2017-02-27',
        //   存储: 'IBM-DS8700(1-1-C08)',
        //   故障类型: 'SAS盘',
        // },
        // {
        //   故障日期: '2017-03-04',
        //   存储: '3PAR-S7400(1-1-H01)',
        //   故障类型: '软件',
        // },
        // {
        //   故障日期: '2017-03-08',
        //   存储: 'EMC-VNX5300(3-3-F05)',
        //   故障类型: '软件',
        // },
        // {
        //   故障日期: '2017-03-15',
        //   存储: 'EMC-VNX5300(3-3-F05)',
        //   故障类型: 'SAS盘',
        // },
        // {
        //   故障日期: '2017-03-27',
        //   存储: 'IBM-DS5100(1-1-F12)',
        //   故障类型: '软件',
        // },
        // {
        //   故障日期: '2017-03-30',
        //   存储: 'EMC-VNX5700(1-1-C04)',
        //   故障类型: '软件',
        // },
        // {
        //   故障日期: '2017-04-05',
        //   存储: 'IBM-DS5100(1-1-F12)',
        //   故障类型: '软件',
        // },
        // {
        //   故障日期: '2017-04-05',
        //   存储: 'EMC-VNX5700(1-1-C03)',
        //   故障类型: 'SAS盘',
        // },
        // {
        //   故障日期: '2017-04-10',
        //   存储: 'IBM-DS8700(1-1-C08)',
        //   故障类型: '电池',
        // },
        // {
        //   故障日期: '2017-04-21',
        //   存储: 'HDS-VSP-G1000(1-1-B01)',
        //   故障类型: '其他',
        // },
        // {
        //   故障日期: '2017-04-28',
        //   存储: 'HDS-VSP-G1000(1-1-B02)',
        //   故障类型: '其他',
        // },
        // {
        //   故障日期: '2017-05-05',
        //   存储: 'EMC-VNX5300(3-3-F05)',
        //   故障类型: '软件',
        // },
        // {
        //   故障日期: '2017-05-06',
        //   存储: 'EMC-VNX5700(1-1-C04)',
        //   故障类型: '软件',
        // },
        // {
        //   故障日期: '2017-05-09',
        //   存储: 'IBM-DS8700(1-1-C08)',
        //   故障类型: 'SAS盘',
        // },
        // {
        //   故障日期: '2017-05-10',
        //   存储: 'IBM-DS8700(1-1-C08)',
        //   故障类型: '电池',
        // },
        // {
        //   故障日期: '2017-05-25',
        //   存储: '3PAR-S8400(1-1-E13)',
        //   故障类型: '软件',
        // },
        // {
        //   故障日期: '2017-06-01',
        //   存储: 'EMC-VNX5300(3-3-F05)',
        //   故障类型: '软件',
        // },
        // {
        //   故障日期: '2017-06-10',
        //   存储: 'IBM-V7000(3-3-F05)',
        //   故障类型: 'SAS盘',
        // },
        // {
        //   故障日期: '2017-06-25',
        //   存储: 'IBM-DS8700(1-1-C08)',
        //   故障类型: 'SAS盘',
        // },
        // {
        //   故障日期: '2017-06-28',
        //   存储: 'EMC-VNX5700(1-1-C04)',
        //   故障类型: '软件',
        // },
        // {
        //   故障日期: '2017-06-29',
        //   存储: 'IBM-DS8700(1-1-C08)',
        //   故障类型: '电池',
        // },
        // {
        //   故障日期: '2017-07-05',
        //   存储: 'EMC-CX240(1-1-F11)',
        //   故障类型: 'SAS盘',
        // },
        // {
        //   故障日期: '2017-07-05',
        //   存储: 'EMC-VNX5300(3-3-F05)',
        //   故障类型: 'SAS盘',
        // },
        // {
        //   故障日期: '2017-07-05',
        //   存储: 'EMC-VNX5700(1-1-C04)',
        //   故障类型: 'SAS盘',
        // },
        // {
        //   故障日期: '2017-07-10',
        //   存储: 'EMC-VNX5700(1-1-C03)',
        //   故障类型: 'SAS盘',
        // },
        // {
        //   故障日期: '2017-07-26',
        //   存储: '3PAR-S8400(1-1-E13)',
        //   故障类型: '软件',
        // },
        // {
        //   故障日期: '2017-07-31',
        //   存储: 'IBM-DS8700(1-1-C08)',
        //   故障类型: '电池',
        // },
        // {
        //   故障日期: '2017-08-02',
        //   存储: 'IBM-V7000(1-1-H11)',
        //   故障类型: 'SAS盘',
        // },
        // {
        //   故障日期: '2017-08-13',
        //   存储: 'HDS-VSP-G1000(1-1-B01)',
        //   故障类型: 'SAS盘',
        // },
        // { 故障日期: '2017-08-21', 存储: 'IBM-SVC(1-1-H12)', 故障类型: '电池' },
        // {
        //   故障日期: '2017-08-11',
        //   存储: '3PAR-S8400(1-1-E13)',
        //   故障类型: '软件',
        // },
        // {
        //   故障日期: '2017-09-01',
        //   存储: 'EMC-VNX5300(3-3-F05)',
        //   故障类型: 'SAS盘',
        // },
        // {
        //   故障日期: '2017-09-02',
        //   存储: 'IBM-DS8700(1-1-C08)',
        //   故障类型: 'SAS盘',
        // },
        // {
        //   故障日期: '2017-10-16',
        //   存储: 'EMC-VNX5700(1-1-C03)',
        //   故障类型: '电池',
        // },
        // {
        //   故障日期: '2017-10-24',
        //   存储: 'IBM-DS8700(1-1-C08)',
        //   故障类型: 'SAS盘',
        // },
        // {
        //   故障日期: '2017-11-13',
        //   存储: 'IBM-DS8700(1-1-C08)',
        //   故障类型: 'SAS盘',
        // },
        // {
        //   故障日期: '2017-11-13',
        //   存储: '3PAR-S8400(1-1-E12)',
        //   故障类型: '软件',
        // },
        // {
        //   故障日期: '2017-11-21',
        //   存储: 'IBM-DS8700(1-1-C08)',
        //   故障类型: 'SAS盘',
        // },
        // {
        //   故障日期: '2017-11-23',
        //   存储: '3PAR-S7400(1-1-H01)',
        //   故障类型: '电源',
        // },
        // {
        //   故障日期: '2017-11-26',
        //   存储: 'EMC-CX240(1-1-F11)',
        //   故障类型: '电源',
        // },
        // {
        //   故障日期: '2017-11-29',
        //   存储: '3PAR-S8400(1-1-E13)',
        //   故障类型: '软件',
        // },
        // {
        //   故障日期: '2017-12-04',
        //   存储: '3PAR-S7400(1-1-H01)',
        //   故障类型: '电源',
        // },
        // {
        //   故障日期: '2017-12-24',
        //   存储: 'EMC-CX240(1-1-F11)',
        //   故障类型: 'SAS盘',
        // },
        // {
        //   故障日期: '2018-01-10',
        //   存储: 'IBM-DS8700(1-1-C08)',
        //   故障类型: 'SAS盘',
        // },
        // {
        //   故障日期: '2018-01-10',
        //   存储: 'EMC-VNX5700(1-1-C04)',
        //   故障类型: '电池',
        // },
        // {
        //   故障日期: '2018-01-11',
        //   存储: 'IBM-V7000(1-1-H11)',
        //   故障类型: 'SAS盘',
        // },
        // {
        //   故障日期: '2018-01-12',
        //   存储: 'EMC-VNX5700(1-1-C04)',
        //   故障类型: 'SAS盘',
        // },
        // {
        //   故障日期: '2018-01-15',
        //   存储: 'IBM-DS8700(1-1-C08)',
        //   故障类型: 'SAS盘',
        // },
        // {
        //   故障日期: '2018-01-18',
        //   存储: 'IBM-V7000(1-1-H11)',
        //   故障类型: 'SAS盘',
        // },
        // {
        //   故障日期: '2018-01-19',
        //   存储: 'EMC-VNX5300(3-3-F05)',
        //   故障类型: 'SAS盘',
        // },
        // {
        //   故障日期: '2018-01-19',
        //   存储: 'EMC-VNX5700(1-1-C03)',
        //   故障类型: 'SAS盘',
        // },
        // {
        //   故障日期: '2018-01-30',
        //   存储: 'EMC-VNX5700(1-1-C03)',
        //   故障类型: 'SAS盘',
        // },
        // {
        //   故障日期: '2018-02-01',
        //   存储: 'EMC-VNX5700(1-1-C03)',
        //   故障类型: 'SAS盘',
        // },
        // {
        //   故障日期: '2018-02-01',
        //   存储: 'EMC-VNX5300(3-3-F05)',
        //   故障类型: 'SAS盘',
        // },
        // {
        //   故障日期: '2018-02-02',
        //   存储: 'IBM-DS8700(1-1-C08)',
        //   故障类型: 'SAS盘',
        // },
        // {
        //   故障日期: '2018-02-02',
        //   存储: 'IBM-DS8700(1-1-C08)',
        //   故障类型: 'SAS盘',
        // },
        // {
        //   故障日期: '2018-02-05',
        //   存储: '3PAR-S8400(1-1-E12)',
        //   故障类型: '其他',
        // },
        // {
        //   故障日期: '2018-02-09',
        //   存储: 'EMC-VNX5700(1-1-C03)',
        //   故障类型: 'SAS盘',
        // },
        // {
        //   故障日期: '2018-02-09',
        //   存储: 'EMC-VNX5300(3-3-F05)',
        //   故障类型: 'SAS盘',
        // },
        // {
        //   故障日期: '2018-02-24',
        //   存储: '3PAR-S8400(1-1-E13)',
        //   故障类型: '内存',
        // },
        // {
        //   故障日期: '2018-02-25',
        //   存储: 'EMC-VNX5300(3-3-F05)',
        //   故障类型: 'SAS盘',
        // },
        // {
        //   故障日期: '2018-03-06',
        //   存储: 'EMC-VNX5700(1-1-C04)',
        //   故障类型: 'SAS盘',
        // },
        // {
        //   故障日期: '2018-03-09',
        //   存储: 'EMC-CX240(1-1-F11)',
        //   故障类型: 'SAS盘',
        // },
        // {
        //   故障日期: '2018-03-27',
        //   存储: 'EMC-VNX5300(3-3-F05)',
        //   故障类型: 'SAS盘',
        // },
        // {
        //   故障日期: '2018-03-27',
        //   存储: 'EMC-VNX5700(1-1-C04)',
        //   故障类型: 'SAS盘',
        // },
        // {
        //   故障日期: '2018-03-27',
        //   存储: 'EMC-CX240(1-1-F11)',
        //   故障类型: 'SAS盘',
        // },
        // {
        //   故障日期: '2018-03-27',
        //   存储: 'IBM-DS8700(1-1-C08)',
        //   故障类型: 'SAS盘',
        // },
        // {
        //   故障日期: '2018-03-28',
        //   存储: 'EMC-VNX5700(1-1-C04)',
        //   故障类型: 'SAS盘',
        // },
        // {
        //   故障日期: '2018-03-28',
        //   存储: 'EMC-VNX5300(1-1-F13)',
        //   故障类型: 'SAS盘',
        // },
        // {
        //   故障日期: '2018-04-13',
        //   存储: '3PAR-S8400(1-1-E12)',
        //   故障类型: 'SAS盘',
        // },
        // {
        //   故障日期: '2018-04-18',
        //   存储: 'EMC-VNX5700(1-1-C04)',
        //   故障类型: '电池',
        // },
        // {
        //   故障日期: '2018-04-19',
        //   存储: 'EMC-VNX5700(1-1-C03)',
        //   故障类型: 'SAS盘',
        // },
        // {
        //   故障日期: '2018-04-19',
        //   存储: 'EMC-CX240(1-1-F11)',
        //   故障类型: 'SAS盘',
        // },
        // {
        //   故障日期: '2018-05-04',
        //   存储: 'HDS-VSP-G1000(1-1-B02)',
        //   故障类型: 'SAS盘',
        // },
        // {
        //   故障日期: '2018-05-11',
        //   存储: 'EMC-CX240(1-1-F11)',
        //   故障类型: 'SAS盘',
        // },
        // {
        //   故障日期: '2018-05-11',
        //   存储: 'EMC-VNX5700(1-1-C04)',
        //   故障类型: 'SAS盘',
        // },
        // {
        //   故障日期: '2018-05-14',
        //   存储: 'IBM-DS8700(1-1-C08)',
        //   故障类型: 'SAS盘',
        // },
        // {
        //   故障日期: '2018-05-16',
        //   存储: '3PAR-S7400(1-1-H01)',
        //   故障类型: '电源',
        // },
        // {
        //   故障日期: '2018-06-05',
        //   存储: 'IBM-DS8700(1-1-C08)',
        //   故障类型: 'SAS盘',
        // },
        // {
        //   故障日期: '2018-06-08',
        //   存储: 'IBM-DS8700(1-1-C08)',
        //   故障类型: 'SAS盘',
        // },
        // {
        //   故障日期: '2018-06-14',
        //   存储: 'IBM-DS8700(1-1-C08)',
        //   故障类型: 'SAS盘',
        // },
        // {
        //   故障日期: '2018-07-05',
        //   存储: 'HDS-VSP-G1000(1-1-B02)',
        //   故障类型: '软件',
        // },
        // {
        //   故障日期: '2018-07-14',
        //   存储: '3PAR-S8400(1-1-E13)',
        //   故障类型: '软件',
        // },
        // {
        //   故障日期: '2018-07-24',
        //   存储: 'EMC-VNX5300(3-3-F05)',
        //   故障类型: 'SAS盘',
        // },
        // {
        //   故障日期: '2018-07-24',
        //   存储: 'EMC-VNX5700(1-1-C03)',
        //   故障类型: 'SAS盘',
        // },
        // {
        //   故障日期: '2018-08-14',
        //   存储: 'EMC-VNX5700(1-1-C03)',
        //   故障类型: '软件',
        // },
        // {
        //   故障日期: '2018-08-14',
        //   存储: 'IBM-DS8700(1-1-C08)',
        //   故障类型: 'SAS盘',
        // },
        // {
        //   故障日期: '2018-08-15',
        //   存储: 'IBM-DS8700(1-1-C08)',
        //   故障类型: 'SAS盘',
        // },
        // {
        //   故障日期: '2018-08-21',
        //   存储: 'EMC-VNX5700(1-1-C03)',
        //   故障类型: 'SAS盘',
        // },
        // {
        //   故障日期: '2018-08-28',
        //   存储: 'IBM-DS8700(1-1-C08)',
        //   故障类型: 'SAS盘',
        // },
        // {
        //   故障日期: '2018-08-29',
        //   存储: 'IBM-DS8700(1-1-C08)',
        //   故障类型: 'SAS盘',
        // },
        // {
        //   故障日期: '2018-08-29',
        //   存储: 'EMC-VNX5700(1-1-C03)',
        //   故障类型: 'SAS盘',
        // },
        // {
        //   故障日期: '2018-09-01',
        //   存储: 'IBM-DS8700(1-1-C08)',
        //   故障类型: 'IO板',
        // },
        // {
        //   故障日期: '2018-09-03',
        //   存储: 'HDS-VSP-G1000(1-1-B02)',
        //   故障类型: '软件',
        // },
        // {
        //   故障日期: '2018-09-13',
        //   存储: 'IBM-V7000(1-1-H11)',
        //   故障类型: 'SAS盘',
        // },
        // {
        //   故障日期: '2018-09-14',
        //   存储: 'EMC-VNX5700(1-1-C03)',
        //   故障类型: 'SAS盘',
        // },
        // {
        //   故障日期: '2018-09-16',
        //   存储: '3PAR-S8400(1-1-E13)',
        //   故障类型: '其他',
        // },
        // {
        //   故障日期: '2018-09-21',
        //   存储: 'IBM-DS8700(1-1-C08)',
        //   故障类型: 'SAS盘',
        // },
        // {
        //   故障日期: '2018-09-29',
        //   存储: '3PAR-S8400(1-1-E13)',
        //   故障类型: '其他',
        // },
        // {
        //   故障日期: '2018-10-12',
        //   存储: 'HDS-VSP-G1000(1-1-B01)',
        //   故障类型: '其他',
        // },
        // {
        //   故障日期: '2018-10-16',
        //   存储: 'IBM-DS8700(1-1-C08)',
        //   故障类型: 'SAS盘',
        // },
        // {
        //   故障日期: '2018-10-18',
        //   存储: 'EMC-VNX5700(1-1-C03)',
        //   故障类型: 'SAS盘',
        // },
        // {
        //   故障日期: '2018-10-18',
        //   存储: 'EMC-VNX5700(1-1-C04)',
        //   故障类型: 'SAS盘',
        // },
        // {
        //   故障日期: '2018-10-18',
        //   存储: 'EMC-VNX5300(1-1-F13)',
        //   故障类型: 'SAS盘',
        // },
        // {
        //   故障日期: '2018-10-22',
        //   存储: 'IBM-DS8700(1-1-C08)',
        //   故障类型: 'SAS盘',
        // },
        // { 故障日期: '2018-11-02', 存储: 'IBM-SVC(1-1-H13)', 故障类型: '软件' },
        // {
        //   故障日期: '2018-11-08',
        //   存储: 'IBM-DS8700(1-1-C08)',
        //   故障类型: 'SAS盘',
        // },
        // { 故障日期: '2018-11-12', 存储: 'HDS-HCP(1-1-G13)', 故障类型: '软件' },
        // {
        //   故障日期: '2018-11-22',
        //   存储: 'EMC-VNX5700(1-1-C04)',
        //   故障类型: 'SAS盘',
        // },
        // {
        //   故障日期: '2018-11-23',
        //   存储: 'IBM-DS8700(1-1-C08)',
        //   故障类型: 'SAS盘',
        // },
        // { 故障日期: '2018-11-27', 存储: 'HDS-HCP(1-1-G13)', 故障类型: 'CPU' },
        // { 故障日期: '2018-12-14', 存储: 'HDS-HCP(1-1-G13)', 故障类型: '内存' },
        // {
        //   故障日期: '2018-12-26',
        //   存储: 'IBM-DS8700(1-1-C08)',
        //   故障类型: 'SAS盘',
        // },
        // {
        //   故障日期: '2018-12-29',
        //   存储: 'EMC-VNX5700(1-1-C04)',
        //   故障类型: 'SAS盘',
        // },
        // {
        //   故障日期: '2019-02-02',
        //   存储: 'EMC-VNX5700(1-1-C04)',
        //   故障类型: '电池',
        // },
        // {
        //   故障日期: '2019-02-02',
        //   存储: 'EMC-VNX5300(3-3-F05)',
        //   故障类型: 'SAS盘',
        // },
        // {
        //   故障日期: '2019-02-08',
        //   存储: 'IBM-V7000(1-1-H09)',
        //   故障类型: 'SAS盘',
        // },
        // {
        //   故障日期: '2019-02-08',
        //   存储: 'EMC-VNX5300(3-3-F05)',
        //   故障类型: 'SAS盘',
        // },
        // {
        //   故障日期: '2019-02-13',
        //   存储: 'IBM-DS8700(1-1-C08)',
        //   故障类型: 'SAS盘',
        // },
        // { 故障日期: '2019-02-14', 存储: 'IBM-HMC(1-1-C10)', 故障类型: '软件' },
        // {
        //   故障日期: '2019-02-18',
        //   存储: 'EMC-VNX5300(3-3-F05)',
        //   故障类型: 'SAS盘',
        // },
        // { 故障日期: '2019-02-28', 存储: 'HDS-HCP(1-1-G13)', 故障类型: 'SAS盘' },
        // {
        //   故障日期: '2019-03-02',
        //   存储: 'EMC-VNX5700(1-1-C04)',
        //   故障类型: 'SAS盘',
        // },
        // {
        //   故障日期: '2019-03-04',
        //   存储: 'EMC-CX240(3-3-F03)',
        //   故障类型: 'SAS盘',
        // },
        // {
        //   故障日期: '2019-03-04',
        //   存储: 'IBM-DS8700(1-1-C08)',
        //   故障类型: 'SAS盘',
        // },
        // {
        //   故障日期: '2019-03-04',
        //   存储: 'IBM-DS8700(1-1-C08)',
        //   故障类型: '软件',
        // },
        // { 故障日期: '2019-03-07', 存储: 'HDS-HCP(1-1-G13)', 故障类型: 'SAS盘' },
        // {
        //   故障日期: '2019-03-08',
        //   存储: 'EMC-VNX5700(1-1-C04)',
        //   故障类型: 'SAS盘',
        // },
        // {
        //   故障日期: '2019-03-08',
        //   存储: 'EMC-VNX5700(1-1-C03)',
        //   故障类型: 'SAS盘',
        // },
        // { 故障日期: '2019-03-09', 存储: 'IBM-SVC(1-1-H12)', 故障类型: '电池' },
        // {
        //   故障日期: '2019-03-11',
        //   存储: '3PAR-S8400(1-1-E12)',
        //   故障类型: 'SAS盘',
        // },
        // {
        //   故障日期: '2019-03-11',
        //   存储: 'EMC-VNX5300(3-3-F05)',
        //   故障类型: 'SAS盘',
        // },
        // {
        //   故障日期: '2019-03-11',
        //   存储: '3PAR-S8400(1-1-E12)',
        //   故障类型: 'SAS盘',
        // },
        // { 故障日期: '2019-03-13', 存储: 'IBM-SVC(1-1-H12)', 故障类型: '电池' },
        // {
        //   故障日期: '2019-03-17',
        //   存储: '3PAR-S8400(1-1-E12)',
        //   故障类型: 'SAS盘',
        // },
        // {
        //   故障日期: '2019-03-17',
        //   存储: 'IBM-DS8700(1-1-C08)',
        //   故障类型: 'SAS盘',
        // },
        // {
        //   故障日期: '2019-03-19',
        //   存储: '3PAR-S8400(1-1-E12)',
        //   故障类型: 'SAS盘',
        // },
        // {
        //   故障日期: '2019-03-29',
        //   存储: '3PAR-S8400(1-1-E12)',
        //   故障类型: 'SAS盘',
        // },
        // {
        //   故障日期: '2019-04-01',
        //   存储: '3PAR-S7400(1-1-H01)',
        //   故障类型: '电源',
        // },
        // {
        //   故障日期: '2019-04-05',
        //   存储: 'HDS-VSP-G1000(1-1-B02)',
        //   故障类型: 'SFP模块',
        // },
        // {
        //   故障日期: '2019-04-11',
        //   存储: 'EMC-CX240(3-3-F03)',
        //   故障类型: 'SAS盘',
        // },
        // {
        //   故障日期: '2019-04-12',
        //   存储: '3PAR-S8400(1-1-E12)',
        //   故障类型: 'SAS盘',
        // },
        // {
        //   故障日期: '2019-04-16',
        //   存储: 'EMC-VNX5700(1-1-C03)',
        //   故障类型: 'SAS盘',
        // },
        // {
        //   故障日期: '2019-04-16',
        //   存储: 'EMC-VNX5300(3-3-F05)',
        //   故障类型: 'SAS盘',
        // },
        // {
        //   故障日期: '2019-04-19',
        //   存储: '3PAR-S8400(1-1-E12)',
        //   故障类型: 'SAS盘',
        // },
        // {
        //   故障日期: '2019-04-21',
        //   存储: '3PAR-S8400(1-1-E12)',
        //   故障类型: 'SAS盘',
        // },
        // {
        //   故障日期: '2019-04-22',
        //   存储: '3PAR-S8400(1-1-E12)',
        //   故障类型: 'SAS盘',
        // },
        // {
        //   故障日期: '2019-04-23',
        //   存储: 'EMC-VNX5700(1-1-C04)',
        //   故障类型: 'SAS盘',
        // },
        // {
        //   故障日期: '2019-04-26',
        //   存储: 'IBM-DS8700(1-1-C08)',
        //   故障类型: 'SAS盘',
        // },
        // {
        //   故障日期: '2019-04-27',
        //   存储: 'IBM-V7000(1-1-H11)',
        //   故障类型: 'SAS盘',
        // },
        // {
        //   故障日期: '2019-04-28',
        //   存储: 'IBM-DS8700(1-1-C08)',
        //   故障类型: 'SAS盘',
        // },
        // { 故障日期: '2019-04-30', 存储: 'HDS-HCP(1-1-G13)', 故障类型: '其他' },
        // {
        //   故障日期: '2019-04-30',
        //   存储: 'IBM-DS8700(1-1-C08)',
        //   故障类型: 'SAS盘',
        // },
        // {
        //   故障日期: '2019-05-01',
        //   存储: 'EMC-VNX5700(1-1-C04)',
        //   故障类型: 'SAS盘',
        // },
        // {
        //   故障日期: '2019-05-02',
        //   存储: '3PAR-S7400(1-1-H01)',
        //   故障类型: '电源',
        // },
        // {
        //   故障日期: '2019-05-06',
        //   存储: 'EMC-VNX5700(1-1-C03)',
        //   故障类型: 'SAS盘',
        // },
        // {
        //   故障日期: '2019-05-07',
        //   存储: 'EMC-VNX5300(3-3-F05)',
        //   故障类型: 'SAS盘',
        // },
        // {
        //   故障日期: '2019-05-07',
        //   存储: '3PAR-S8200(3-3-F04)',
        //   故障类型: '电源',
        //   进场时间: '2019-05-07',
        // },
        // {
        //   故障日期: '2019-05-10',
        //   存储: 'EMC-VNX5700(1-1-C04)',
        //   故障类型: '电源',
        // },
        // {
        //   故障日期: '2019-05-10',
        //   存储: '3PAR-S8400(1-1-E12)',
        //   故障类型: '其他',
        // },
        // { 故障日期: '2019-05-22', 存储: 'HDS-HCP(1-1-G13)', 故障类型: 'SSD盘' },
        // { 故障日期: '2019-05-28', 存储: 'HDS-HCP(1-1-G13)', 故障类型: '软件' },
        // {
        //   故障日期: '2019-06-04',
        //   存储: 'EMC-VNX5700(1-1-C04)',
        //   故障类型: 'SAS盘',
        // },
        // {
        //   故障日期: '2019-06-05',
        //   存储: 'EMC-CX240(3-3-F03)',
        //   故障类型: 'SAS盘',
        // },
        // {
        //   故障日期: '2019-06-18',
        //   存储: 'EMC-VNX5300(3-3-F05)',
        //   故障类型: 'SAS盘',
        // },
        // {
        //   故障日期: '2019-06-18',
        //   存储: 'EMC-VNX5700(1-1-C03)',
        //   故障类型: 'SAS盘',
        // },
        // { 故障日期: '2019-06-18', 存储: 'HDS-HCP(1-1-G13)', 故障类型: '其他' },
        // {
        //   故障日期: '2019-06-23',
        //   存储: 'IBM-DS8700(1-1-C08)',
        //   故障类型: 'SAS盘',
        // },
        // {
        //   故障日期: '2019-06-24',
        //   存储: 'EMC-VNX5300(3-3-F05)',
        //   故障类型: '其他',
        // },
        // { 故障日期: '2019-06-21', 存储: 'HDS-HCP(1-1-G13)', 故障类型: '内存' },
        // {
        //   故障日期: '2019-06-25',
        //   存储: 'IBM-DS5100(1-1-F12)',
        //   故障类型: '软件',
        // },
        // {
        //   故障日期: '2019-06-28',
        //   存储: 'HDS-VSP-G1000(1-1-B01)',
        //   故障类型: '软件',
        // },
        // {
        //   故障日期: '2019-06-28',
        //   存储: 'EMC-VNX5300(3-3-F05)',
        //   故障类型: '电池',
        // },
        // { 故障日期: '2019-06-28', 存储: 'HDS-HCP(1-1-G13)', 故障类型: '内存' },
        // {
        //   故障日期: '2019-07-07',
        //   存储: 'HDS-VSP-G1000(1-1-B02)',
        //   故障类型: 'SAS盘',
        // },
        // {
        //   故障日期: '2019-07-09',
        //   存储: 'EMC-VNX5700(1-1-C03)',
        //   故障类型: 'SAS盘',
        // },
        // {
        //   故障日期: '2019-07-11',
        //   存储: 'EMC-VNX5700(1-1-C03)',
        //   故障类型: 'SAS盘',
        // },
        // {
        //   故障日期: '2019-07-11',
        //   存储: 'EMC-VNX5300(3-3-F05)',
        //   故障类型: 'SAS盘',
        // },
        // {
        //   故障日期: '2019-07-16',
        //   存储: 'EMC-VNX5700(1-1-C04)',
        //   故障类型: 'SAS盘',
        // },
        // {
        //   故障日期: '2019-07-16',
        //   存储: 'EMC-CX240(1-1-F11)',
        //   故障类型: 'SAS盘',
        // },
        // {
        //   故障日期: '2019-07-17',
        //   存储: 'EMC-VNX5300(3-3-F05)',
        //   故障类型: 'SAS盘',
        // },
        // {
        //   故障日期: '2019-07-22',
        //   存储: 'IBM-DS8700(1-1-C08)',
        //   故障类型: 'SAS盘',
        // },
        // {
        //   故障日期: '2019-07-24',
        //   存储: 'EMC-VNX5700(1-1-C03)',
        //   故障类型: 'SAS盘',
        // },
        // {
        //   故障日期: '2019-07-27',
        //   存储: 'HDS-VSP-G1000(1-1-B01)',
        //   故障类型: '电池',
        // },
        // {
        //   故障日期: '2019-07-29',
        //   存储: 'EMC-VNX5700(1-1-C03)',
        //   故障类型: 'SAS盘',
        // },
        // {
        //   故障日期: '2019-07-31',
        //   存储: 'EMC-VNX5300(3-3-F05)',
        //   故障类型: '电池',
        // },
        // {
        //   故障日期: '2019-08-04',
        //   存储: 'EMC-CX240(1-1-F11)',
        //   故障类型: 'SAS盘',
        // },
        // {
        //   故障日期: '2019-08-07',
        //   存储: 'IBM-V7000(1-1-H11)',
        //   故障类型: 'SAS盘',
        // },
        // {
        //   故障日期: '2019-08-09',
        //   存储: 'EMC-VNX5700(1-1-C03)',
        //   故障类型: 'SAS盘',
        // },
        // {
        //   故障日期: '2019-08-11',
        //   存储: 'EMC-VNX5300(3-3-F05)',
        //   故障类型: '电池',
        // },
        // {
        //   故障日期: '2019-08-15',
        //   存储: 'IBM-V7000(1-1-H11)',
        //   故障类型: 'SAS盘',
        // },
        // { 故障日期: '2019-08-19', 存储: 'HDS-HCP(1-1-G13)', 故障类型: '软件' },
        // {
        //   故障日期: '2019-08-23',
        //   存储: '3PAR-S8400(1-1-E13)',
        //   故障类型: '软件',
        // },
        // {
        //   故障日期: '2019-07-27',
        //   存储: 'HDS-VSP-G1000(1-1-B01)',
        //   故障类型: '电池',
        // },
        // {
        //   故障日期: '2019-08-26',
        //   存储: 'EMC-VNX5300(3-3-F05)',
        //   故障类型: '电池',
        // },
        // {
        //   故障日期: '2019-09-02',
        //   存储: 'EMC-VNX5700(1-1-C04)',
        //   故障类型: 'SAS盘',
        // },
        // {
        //   故障日期: '2019-09-03',
        //   存储: 'IBM-V7000(1-1-H11)',
        //   故障类型: 'SAS盘',
        // },
        // {
        //   故障日期: '2019-09-05',
        //   存储: 'EMC-VNX5700(1-1-C04)',
        //   故障类型: 'SAS盘',
        // },
        // {
        //   故障日期: '2019-09-05',
        //   存储: 'EMC-VNX5700(1-1-C03)',
        //   故障类型: 'SAS盘',
        // },
        // {
        //   故障日期: '2019-09-09',
        //   存储: 'IBM-DS8700(1-1-C08)',
        //   故障类型: 'SAS盘',
        // },
        // {
        //   故障日期: '2019-09-23',
        //   存储: 'HDS-VSP-G1000(1-1-B01)',
        //   故障类型: '电池',
        // },
        // {
        //   故障日期: '2019-09-27',
        //   存储: 'EMC-VNX5300(1-1-F13)',
        //   故障类型: 'SAS盘',
        // },
        // {
        //   故障日期: '2019-09-29',
        //   存储: 'IBM-V7000(1-1-H11)',
        //   故障类型: 'SAS盘',
        // },
        // {
        //   故障日期: '2019-10-08',
        //   存储: 'IBM-DS8700(1-1-C08)',
        //   故障类型: 'SAS盘',
        // },
        // {
        //   故障日期: '2019-10-10',
        //   存储: 'EMC-VNX5700(1-1-C04)',
        //   故障类型: 'SAS盘',
        // },
        // {
        //   故障日期: '2019-10-15',
        //   存储: '3PAR-S8400(1-1-E12)',
        //   故障类型: '其他',
        // },
        // {
        //   故障日期: '2019-10-18',
        //   存储: '3PAR-S8400(1-1-E12)',
        //   故障类型: '其他',
        // },
        // {
        //   故障日期: '2019-10-20',
        //   存储: 'HDS-VSP-G1000(1-1-B01)',
        //   故障类型: 'SAS盘',
        // },
        // {
        //   故障日期: '2019-10-22',
        //   存储: '3PAR-S8400(1-1-E13)',
        //   故障类型: 'SAS盘',
        // },
        // { 故障日期: '2019-11-02', 存储: 'IBM-SVC(1-1-H13)', 故障类型: '电池' },
        // {
        //   故障日期: '2019-11-03',
        //   存储: '3PAR-S8400(1-1-E12)',
        //   故障类型: 'SSD盘',
        // },
        // {
        //   故障日期: '2019-11-07',
        //   存储: 'EMC-CX240(1-1-F11)',
        //   故障类型: 'SAS盘',
        // },
        // {
        //   故障日期: '2019-11-10',
        //   存储: '3PAR-S8200(3-3-F04)',
        //   故障类型: '电源',
        //   进场时间: '2019-05-07',
        // },
        // {
        //   故障日期: '2019-11-12',
        //   存储: 'EMC-VNX5700(1-1-C04)',
        //   故障类型: 'SAS盘',
        // },
        // {
        //   故障日期: '2019-11-12',
        //   存储: 'EMC-VNX5700(1-1-C03)',
        //   故障类型: 'SAS盘',
        // },
        // { 故障日期: '2019-11-12', 存储: 'IBM-SVC(3-3-F05)', 故障类型: '软件' },
        // {
        //   故障日期: '2019-11-14',
        //   存储: '3PAR-S7400(1-1-H01)',
        //   故障类型: '电源',
        // },
        // {
        //   故障日期: '2019-11-17',
        //   存储: 'EMC-VNX5700(1-1-C03)',
        //   故障类型: 'SAS盘',
        // },
        // { 故障日期: '2019-11-29', 存储: 'IBM-SVC(3-3-F05)', 故障类型: 'SAS盘' },
        // {
        //   故障日期: '2019-12-11',
        //   存储: 'EMC-VNX5700(1-1-C03)',
        //   故障类型: 'SAS盘',
        // },
        // {
        //   故障日期: '2019-12-11',
        //   存储: 'EMC-CX240(1-1-F11)',
        //   故障类型: 'SAS盘',
        // },
        // {
        //   故障日期: '2019-12-13',
        //   存储: 'HDS-VSP-G1000(1-1-B01)',
        //   故障类型: '软件',
        // },
        // { 故障日期: '2019-12-17', 存储: 'HDS-HCP(1-1-G13)', 故障类型: 'CPU' },
        // {
        //   故障日期: '2019-12-19',
        //   存储: 'HDS-VSP-G1000(1-1-B02)',
        //   故障类型: '软件',
        // },
        // {
        //   故障日期: '2019-12-19',
        //   存储: '3PAR-S20800(1-1-B06)',
        //   故障类型: '电源',
        //   进场时间: '2019-12-06',
        // },
        // {
        //   故障日期: '2019-12-22',
        //   存储: '3PAR-S8400(1-1-E13)',
        //   故障类型: 'SAS盘',
        // },
        // { 故障日期: '2019-12-27', 存储: 'HDS-HCP(1-1-G13)', 故障类型: 'SAS盘' },
        // { 故障日期: '2019-12-27', 存储: 'HDS-HCP(1-1-G13)', 故障类型: '软件' },
        // {
        //   故障日期: '2020-01-03',
        //   存储: 'EMC-VNX5300(3-3-F05)',
        //   故障类型: '软件',
        // },
        // {
        //   故障日期: '2020-01-08',
        //   存储: 'IBM-DS8700(1-1-C08)',
        //   故障类型: 'SAS盘',
        // },
        // {
        //   故障日期: '2020-01-14',
        //   存储: 'EMC-VNX5700(1-1-C03)',
        //   故障类型: 'SAS盘',
        // },
        // {
        //   故障日期: '2020-01-14',
        //   存储: 'EMC-VNX5700(1-1-C04)',
        //   故障类型: 'SAS盘',
        // },
        // {
        //   故障日期: '2020-01-15',
        //   存储: 'IBM-DS8700(1-1-C08)',
        //   故障类型: 'SAS盘',
        // },
        // {
        //   故障日期: '2020-01-18',
        //   存储: '3PAR-S8200(3-3-F04)',
        //   故障类型: '软件',
        //   进场时间: '2019-05-07',
        // },
        // {
        //   故障日期: '2020-02-03',
        //   存储: 'EMC-VNX5700(1-1-C03)',
        //   故障类型: 'SAS盘',
        // },
        // {
        //   故障日期: '2020-02-03',
        //   存储: '3PAR-S8200(3-3-F04)',
        //   故障类型: '软件',
        //   进场时间: '2019-05-07',
        // },
        // {
        //   故障日期: '2020-02-19',
        //   存储: '3PAR-S8400(1-1-E12)',
        //   故障类型: '其他',
        // },
        // {
        //   故障日期: '2020-02-19',
        //   存储: 'HDS-VSP-G1000(1-1-B01)',
        //   故障类型: '其他',
        // },
        // {
        //   故障日期: '2020-02-25',
        //   存储: 'IBM-DS8700(1-1-C08)',
        //   故障类型: 'SAS盘',
        // },
        // {
        //   故障日期: '2020-02-25',
        //   存储: 'IBM-V7000(1-1-H11)',
        //   故障类型: 'SAS盘',
        // },
        // {
        //   故障日期: '2020-02-27',
        //   存储: 'EMC-VNX5300(3-3-F05)',
        //   故障类型: 'SAS盘',
        // },
        // {
        //   故障日期: '2020-02-27',
        //   存储: 'EMC-CX240(1-1-F11)',
        //   故障类型: 'SAS盘',
        // },
        // {
        //   故障日期: '2020-02-28',
        //   存储: 'IBM-V7000(1-1-H11)',
        //   故障类型: 'SAS盘',
        // },
        // {
        //   故障日期: '2020-02-28',
        //   存储: 'HDS-VSP-G1000(1-1-B02)',
        //   故障类型: 'SAS盘',
        // },
        // {
        //   故障日期: '2020-03-04',
        //   存储: 'IBM-DS8700(1-1-C08)',
        //   故障类型: 'SAS盘',
        // },
        // {
        //   故障日期: '2020-03-09',
        //   存储: 'EMC-VNX5300(3-3-F05)',
        //   故障类型: 'SAS盘',
        // },
        // {
        //   故障日期: '2020-03-09',
        //   存储: 'IBM-DS8700(1-1-C08)',
        //   故障类型: 'SAS盘',
        // },
        // {
        //   故障日期: '2020-03-12',
        //   存储: 'EMC-CX240(1-1-F11)',
        //   故障类型: '电池',
        // },
        // { 故障日期: '2020-03-12', 存储: 'IBM-HMC(1-1-C01)', 故障类型: '软件' },
        // {
        //   故障日期: '2020-03-21',
        //   存储: 'IBM-DS8700(1-1-C08)',
        //   故障类型: 'SAS盘',
        // },
        // {
        //   故障日期: '2020-03-22',
        //   存储: 'EMC-CX240(1-1-F11)',
        //   故障类型: '电池',
        // },
        // {
        //   故障日期: '2020-03-22',
        //   存储: '3PAR-S8400(1-1-E13)',
        //   故障类型: 'SAS盘',
        // },
        // { 故障日期: '2020-03-28', 存储: 'HDS-HCP(1-1-G13)', 故障类型: 'SAS盘' },
        // {
        //   故障日期: '2020-03-28',
        //   存储: 'EMC-CX240(1-1-F11)',
        //   故障类型: 'SAS盘',
        // },
        // {
        //   故障日期: '2020-03-28',
        //   存储: 'HDS-VSP-G1000(1-1-B02)',
        //   故障类型: 'SAS盘',
        // },
        // { 故障日期: '2020-04-05', 存储: 'IBM-HMC(1-1-C01)', 故障类型: 'SAS盘' },
        // { 故障日期: '2020-04-06', 存储: 'IBM-SVC(1-1-H12)', 故障类型: '电池' },
        // {
        //   故障日期: '2020-04-10',
        //   存储: 'EMC-CX240(1-1-F11)',
        //   故障类型: '电池',
        // },
        // {
        //   故障日期: '2020-04-13',
        //   存储: 'EMC-VNX5300(3-3-F05)',
        //   故障类型: 'SAS盘',
        // },
        // {
        //   故障日期: '2020-04-16',
        //   存储: 'HDS-VSP-G1000(1-1-B02)',
        //   故障类型: 'SFP模块',
        // },
        // { 故障日期: '2020-04-20', 存储: 'HDS-HCP(1-1-G13)', 故障类型: '软件' },
        // {
        //   故障日期: '2020-04-20',
        //   存储: 'EMC-VNX5700(1-1-C04)',
        //   故障类型: '软件',
        // },
        // {
        //   故障日期: '2020-04-24',
        //   存储: '3PAR-S20800(1-1-B05)',
        //   故障类型: '其他',
        //   进场时间: '2019-12-06',
        // },
        // { 故障日期: '2020-04-05', 存储: 'IBM-HMC(1-1-C01)', 故障类型: '电池' },
        // { 故障日期: '2020-04-06', 存储: 'IBM-SVC(1-1-H12)', 故障类型: '电池' },
        // {
        //   故障日期: '2020-04-10',
        //   存储: 'EMC-CX240(1-1-F11)',
        //   故障类型: '电池',
        // },
        // {
        //   故障日期: '2020-04-13',
        //   存储: 'EMC-VNX5300(3-3-F05)',
        //   故障类型: 'SAS盘',
        // },
        // { 故障日期: '2020-04-30', 存储: 'HDS-HCP(1-1-G13)', 故障类型: 'SSD盘' },
        // {
        //   故障日期: '2020-05-01',
        //   存储: 'EMC-VNX5700(1-1-C03)',
        //   故障类型: 'SAS盘',
        // },
        // {
        //   故障日期: '2020-05-01',
        //   存储: 'EMC-VNX5300(3-3-F05)',
        //   故障类型: 'SAS盘',
        // },
        // {
        //   故障日期: '2020-05-02',
        //   存储: 'EMC-VNX5700(1-1-C03)',
        //   故障类型: '电池',
        // },
        // {
        //   故障日期: '2020-05-02',
        //   存储: 'EMC-VNX5300(3-3-F05)',
        //   故障类型: 'SAS盘',
        // },
        // {
        //   故障日期: '2020-05-06',
        //   存储: 'EMC-VNX5700(1-1-C03)',
        //   故障类型: '软件',
        // },
        // {
        //   故障日期: '2020-05-11',
        //   存储: 'EMC-VNX5700(1-1-C04)',
        //   故障类型: 'SAS盘',
        // },
        // {
        //   故障日期: '2020-05-14',
        //   存储: 'EMC-VNX5300(3-3-F05)',
        //   故障类型: 'SAS盘',
        // },
        // { 故障日期: '2020-06-04', 存储: 'HDS-HCP(1-1-G13)', 故障类型: '软件' },
        // { 故障日期: '2020-06-06', 存储: 'HDS-HCP(1-1-G13)', 故障类型: 'SAS盘' },
        // {
        //   故障日期: '2020-06-11',
        //   存储: 'EMC-VNX5700(1-1-C03)',
        //   故障类型: 'SAS盘',
        // },
        // {
        //   故障日期: '2020-06-14',
        //   存储: 'IBM-V7000(3-3-F05)',
        //   故障类型: '其他',
        // },
        // {
        //   故障日期: '2020-06-22',
        //   存储: 'EMC-VNX5700(1-1-C04)',
        //   故障类型: 'SAS盘',
        // },
        // {
        //   故障日期: '2020-06-22',
        //   存储: 'IBM-DS8700(1-1-C08)',
        //   故障类型: 'SAS盘',
        // },
        // { 故障日期: '2020-07-01', 存储: 'HDS-HCP(1-1-G13)', 故障类型: '其他' },
        // {
        //   故障日期: '2020-07-01',
        //   存储: 'EMC-CX240(1-1-F11)',
        //   故障类型: 'SAS盘',
        // },
        // {
        //   故障日期: '2020-07-07',
        //   存储: 'EMC-VNX5300(3-3-F05)',
        //   故障类型: 'SAS盘',
        // },
        // {
        //   故障日期: '2020-07-10',
        //   存储: 'IBM-DS8700(1-1-C08)',
        //   故障类型: 'SAS盘',
        // },
        // {
        //   故障日期: '2020-07-12',
        //   存储: 'EMC-VNX5700(1-1-C04)',
        //   故障类型: '软件',
        // },
        // {
        //   故障日期: '2020-07-14',
        //   存储: '3PAR-S7400(1-1-H01)',
        //   故障类型: '电源',
        // },
        // { 故障日期: '2020-07-15', 存储: 'IBM-SVC(1-1-H12)', 故障类型: '软件' },
        // {
        //   故障日期: '2020-07-06',
        //   存储: 'IBM-DS8700(1-1-C08)',
        //   故障类型: 'SAS盘',
        // },
        // {
        //   故障日期: '2020-07-18',
        //   存储: 'EMC-CX240(1-1-F11)',
        //   故障类型: 'SAS盘',
        // },
        // { 故障日期: '2020-07-21', 存储: 'IBM-HMC(1-1-C01)', 故障类型: '其他' },
        // {
        //   故障日期: '2020-07-24',
        //   存储: 'IBM-V7000(1-1-H11)',
        //   故障类型: 'SAS盘',
        // },
        // {
        //   故障日期: '2020-07-25',
        //   存储: '3PAR-S8400(1-1-E12)',
        //   故障类型: 'SSD盘',
        // },
        // {
        //   故障日期: '2020-07-30',
        //   存储: 'EMC-VNX5300(3-3-F05)',
        //   故障类型: '软件',
        // },
        // {
        //   故障日期: '2020-08-03',
        //   存储: 'EMC-VNX5700(1-1-C04)',
        //   故障类型: '软件',
        // },
        // { 故障日期: '2020-08-07', 存储: 'IBM-SVC(3-3-F05)', 故障类型: '软件' },
        // {
        //   故障日期: '2020-08-20',
        //   存储: 'EMC-VNX5300(3-3-F05)',
        //   故障类型: '软件',
        // },
        // { 故障日期: '2020-08-21', 存储: 'IBM-SVC(3-3-F05)', 故障类型: '软件' },
        // {
        //   故障日期: '2020-08-21',
        //   存储: '3PAR-S20800(1-1-B05)',
        //   故障类型: '其他',
        //   进场时间: '2019-12-06',
        // },
        // {
        //   故障日期: '2020-08-24',
        //   存储: '3PAR-S20800(1-1-B05)',
        //   故障类型: '软件',
        //   进场时间: '2019-12-06',
        // },
        // {
        //   故障日期: '2020-08-29',
        //   存储: '3PAR-S8400(1-1-E13)',
        //   故障类型: 'SAS盘',
        // },
        // {
        //   故障日期: '2020-09-07',
        //   存储: 'EMC-VNX5700(1-1-C03)',
        //   故障类型: 'SAS盘',
        // },
        // {
        //   故障日期: '2020-09-12',
        //   存储: 'EMC-VNX5700(1-1-C03)',
        //   故障类型: '软件',
        // },
        // {
        //   故障日期: '2020-09-17',
        //   存储: 'EMC-VNX5700(1-1-C03)',
        //   故障类型: '软件',
        // },
        // { 故障日期: '2020-09-28', 存储: 'HDS-HCP(1-1-E13)', 故障类型: '其他' },
        // {
        //   故障日期: '2020-09-29',
        //   存储: 'EMC-VNX5700(1-1-C04)',
        //   故障类型: 'SAS盘',
        // },
        // {
        //   故障日期: '2020-10-08',
        //   存储: '3PAR-S8200(3-3-F04)',
        //   故障类型: '其他',
        //   进场时间: '2019-05-07',
        // },
        // {
        //   故障日期: '2020-10-09',
        //   存储: '3PAR-S20800(1-1-B06)',
        //   故障类型: '其他',
        //   进场时间: '2019-12-06',
        // },
        // {
        //   故障日期: '2020-10-13',
        //   存储: 'HDS-VSP-G1000(1-1-B01)',
        //   故障类型: 'SAS盘',
        // },
        // {
        //   故障日期: '2020-10-18',
        //   存储: 'EMC-VNX5700(1-1-C03)',
        //   故障类型: 'SAS盘',
        // },
        // {
        //   故障日期: '2020-10-22',
        //   存储: 'EMC-VNX5700(1-1-C03)',
        //   故障类型: '软件',
        // },
        // {
        //   故障日期: '2020-10-22',
        //   存储: 'EMC-VNX5300(3-3-F05)',
        //   故障类型: '软件',
        // },
        // {
        //   故障日期: '2020-10-25',
        //   存储: 'EMC-VNX5300(3-3-F05)',
        //   故障类型: '电池',
        // },
        // {
        //   故障日期: '2020-11-08',
        //   存储: 'EMC-VNX5300(1-1-F13)',
        //   故障类型: '电池',
        // },
        // {
        //   故障日期: '2020-11-13',
        //   存储: '3PAR-S8200(3-3-F04)',
        //   故障类型: '其他',
        //   进场时间: '2019-05-07',
        // },
        // {
        //   故障日期: '2020-11-13',
        //   存储: 'IBM-DS8700(1-1-C08)',
        //   故障类型: 'SAS盘',
        // },
        // {
        //   故障日期: '2020-11-14',
        //   存储: 'EMC-VNX5700(1-1-C04)',
        //   故障类型: '软件',
        // },
        // {
        //   故障日期: '2020-11-15',
        //   存储: 'EMC-VNX5300(3-3-F05)',
        //   故障类型: 'SAS盘',
        // },
        // {
        //   故障日期: '2020-11-15',
        //   存储: 'EMC-VNX5700(1-1-C03)',
        //   故障类型: 'SAS盘',
        // },
        // {
        //   故障日期: '2020-11-20',
        //   存储: 'EMC-CX240(1-1-F11)',
        //   故障类型: 'SAS盘',
        // },
        // {
        //   故障日期: '2020-11-26',
        //   存储: 'IBM-V7000(3-3-F05)',
        //   故障类型: 'SAS盘',
        // },
        // {
        //   故障日期: '2020-11-27',
        //   存储: '3PAR-S8400(1-1-E13)',
        //   故障类型: '软件',
        // },
        // {
        //   故障日期: '2020-11-29',
        //   存储: '3PAR-S7400(1-1-H01)',
        //   故障类型: 'SAS盘',
        // },
        // {
        //   故障日期: '2020-11-30',
        //   存储: '3PAR-S8400(1-1-E13)',
        //   故障类型: 'SAS盘',
        // },
        // {
        //   故障日期: '2020-12-17',
        //   存储: 'IBM-V7000(1-1-H11)',
        //   故障类型: 'SAS盘',
        // },
        // { 故障日期: '2020-12-22', 存储: 'IBM-SVC(1-1-H12)', 故障类型: '其他' },
        // {
        //   故障日期: '2020-12-28',
        //   存储: '华为-6850(1-1-B08)',
        //   故障类型: '控制器',
        //   进场时间: '2020-08-10',
        // },
      ]

      for (let rec of data) {
        if (
          -1 === type.indexOf(rec['故障类型']) &&
          rec['故障类型'] !== '其他'
        ) {
          type.push(rec['故障类型'])
        }
      }
      type.push('其他')

      var macMap = []
      var yAx = []
      for (let rec of data) {
        // 随机生成故障日期和故障类型
        //rec["日期"] = new Date( new Date("2016-01-01").getTime() + (new Date().getTime() - new Date("2016-01-01").getTime()) * Math.random()  );
        //rec["日期"] = `${rec["日期"].getFullYear()}-${rec["日期"].getMonth() < 10 ? '0':''}${rec["日期"].getMonth()}-${rec["日期"].getDate() < 10 ? '0':''}${rec["日期"].getDate()}`;
        //rec["类型"] = type[Math.floor(type.length * Math.random())]
        if (-1 === macMap.indexOf(rec['存储'])) {
          macMap.push(rec['存储'])
          yAx.push(yAx.length)
        }
      }
      macMap.sort()
      //yAx.push(yAx.length + 1)

      function calcX(sDate, rec) {
        let minDt = new Date('2015-01-01') // 故障最早时间点
        let trdDt = new Date('2015-01-01')
        trdDt.setYear(minDt.getFullYear() + 3)
        let friDt = new Date('2015-01-01')
        friDt.setYear(minDt.getFullYear() + 5)
        let eigDt = new Date('2015-01-01')
        eigDt.setYear(minDt.getFullYear() + 8)

        if (rec['进场时间']) {
          minDt = new Date(rec['进场时间']) // 故障最早时间点
          trdDt = new Date(rec['进场时间'])
          trdDt.setYear(minDt.getFullYear() + 3)
          friDt = new Date(rec['进场时间'])
          friDt.setYear(minDt.getFullYear() + 5)
          eigDt = new Date(rec['进场时间'])
          eigDt.setYear(minDt.getFullYear() + 8)
        }

        let recDt = new Date(sDate) // 当前故障时间点
        if (recDt.getTime() <= trdDt.getTime()) {
          return (
            (3 * // (new Date(sDate).getYear() - minDt.getYear())
              // +
              (new Date(sDate).getTime() - minDt.getTime())) /
            (trdDt.getTime() - minDt.getTime())
          )
        } else if (recDt.getTime() <= friDt.getTime()) {
          return (
            3 +
            (2 * (new Date(sDate).getTime() - trdDt.getTime())) /
              (friDt.getTime() - trdDt.getTime())
          )
        } else if (recDt.getTime() <= eigDt.getTime()) {
          return (
            5 +
            (3 * (new Date(sDate).getTime() - friDt.getTime())) /
              (eigDt.getTime() - friDt.getTime())
          )
        }
      }

      function calcY(sDate, sName) {
        return macMap.indexOf(sName)
        //let idx = macMap.indexOf(sName) * 7;
        //return (6 - new Date(sDate).getDay()) + idx;
      }

      for (let rec of data) {
        rec.x = calcX(rec['故障日期'], rec)
        rec.y = calcY(rec['故障日期'], rec['存储'])
      }

      var ds = [
        // x是按 (当前日期-最小日期) / (最大日期 - 最小日期) 的一个比例得出的位置
        // y是按 (当前日期所在星期) + (存储的序号下标 x 7) 得出哪个存储哪个星期几发生的故障
        {
          dimensions: ['故障类型', 'x', 'y', '存储', '故障日期'],
          source: data,
        },
      ]
      var ss = []
      for (let t of type) {
        ds.push({
          transform: {
            type: 'filter',
            config: { dimension: '故障类型', '=': t },
          },
        })

        ss.push({
          name: t,
          datasetIndex: ss.length + 1,
          type: 'scatter',
          //symbolSize: 4,
          encode: {
            x: 'x',
            y: 'y',
          },
        })
        // }
      }

      option = {
        title: {
          text: '存储故障分布图',
          left: '1%',
        },
        legend: {},
        tooltip: {
          formatter: param => {
            // console.log(this);
            // return param.seriesName + ' <br/>'
            //     + param.value["存储"] + ' <br/>'
            //     + param.value["日期"] + ' <br/>';
            return `故障设备: ${param.value['存储']} <br/>故障类型: ${param.value['故障类型']} <br/>故障日期: ${param.value['故障日期']}`
          },
        },
        dataset: ds,
        xAxis: {
          type: 'value',
          axisTick: {
            alignWithLabel: true,
          },
          axisLabel: {
            align: '',
            formatter: param => {
              if (Number.parseFloat(param) <= 3) {
                if (3 === param) {
                  return `3年`
                } else {
                  return ''
                }
              } else if (Number.parseFloat(param) <= 5) {
                if (5 === param) {
                  return `5年`
                } else {
                  return ''
                }
              } else if (Number.parseFloat(param) <= 8) {
                if (8 === param) {
                  return `8年`
                } else {
                  return ''
                }
              }
            },
          },
        },
        yAxis: {
          type: 'category',
          position: 'bottom',
          data: yAx, //[1, 2, 3, 4, 5, 6,7,8,9,10,11,12,13,14],
          axisTick: {
            alignWithLabel: true,
          },
          axisLabel: {
            align: '',
            formatter: param => {
              return macMap[param]
            },
          },
        },
        series: ss,
      }

      myChart.setOption(option)
      this.chartInstance = myChart
      // 将option赋值给chartOption，此时chartOption内容是一个对象
      this.chartOption = option
    },
    // 更改图表
    changeChart(script,data) {
      // 用echarts时，如果不存在DOM，就会报错，处理方法先检查是否DOM存在：
      if (this.$refs.chartRef == null) {
        return
      }
      // 用echarts时，如果存在DOM，就会报存在警告，处理方法删除DOM：
      this.$echarts.dispose(this.$refs.chartRef)
      try {
        data = JSON.stringify(data)
        let func = new Function(
          'echarts',
          `const ROOT_PATH = 'https://cdn.jsdelivr.net/gh/apache/echarts-website@asf-site/examples';var option;let myChart = echarts.init(this.$refs.chartRef);let data;data = ${data};` +
            script +
            `myChart.clear();option && myChart.setOption(option);`
        ).bind(this)
        func(this.$echarts)
      } catch (error) {
        console.log(error);
        this.$message({
          message: '数据或代码出错',
          type: 'error',
        })
      }
    },
    // 当浏览器大小发生变化时候，调用方法完成屏幕适配
    screenAdapter() {
      const titleFontSize = (this.$refs.chartRef.offsetWidth / 100) * 1.5
      // 和分辨率大小相关的配置项
      const adapterOption = {
        title: {
          textStyle: {
            fontSize: titleFontSize,
          },
        },
      }
      this.chartInstance.setOption(adapterOption)
      // 手动调用图表对象的resize才能产生效果
      this.chartInstance.resize()
    },
  },
}
</script>
<style lang="less" scoped></style>
